{
  "_name_or_path": "./fed-glm-module/client_part3/",
  "architectures": [
    "ChatGLMModel"
  ],
  "auto_map": {
    "AutoConfig": "client_partC_config.ClientCChatGLMConfig",
    "AutoModel": "client_model_partC.ChatGLMForConditionalGenerationClientSideC",
    "AutoModelForSeq2SeqLM": "client_model_partC.ChatGLMForConditionalGenerationClientSideC"
  },
  "bos_token_id": 130004,
  "eos_token_id": 130005,
  "mask_token_id": 130000,
  "gmask_token_id": 130001,
  "pad_token_id": 3,
  "hidden_size": 4096,
  "inner_hidden_size": 16384,
  "layernorm_epsilon": 1e-05,
  "max_sequence_length": 2048,
  "model_type": "chatglm",
  "num_attention_heads": 32,
  "num_layers": 28,
  "position_encoding_2d": true,
  "torch_dtype": "float16",
  "transformers_version": "4.23.1",
  "use_cache": true,
  "vocab_size": 130528
}
